Revit 2027 API
IFCAnyHandle.CreateAggregateAttribute Method
 Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAggregate CreateAggregateAttribute(
	string name
)
Public Function CreateAggregateAttribute (
	name As String
) As IFCAggregate
public:
IFCAggregate^ CreateAggregateAttribute(
	String^ name
)
member CreateAggregateAttribute :
        name : string -> IFCAggregate
Parameters
name String
 The attribute name.
Return Value
IFCAggregate
 The aggregate.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace